{
  "1": {
    "title": "Перекресток судьбы",
    "text": "Год 1761. Вам шестнадцать лет. Вы — Федор Ушаков, сын бедного отставного сержанта Преображенского полка из глухого сельца Бурнаково Ярославской губернии. Отец предлагает остаться в имении и вести хозяйство. Но из Петербурга пришло известие: Морской шляхетный кадетский корпус набирает воспитанников. Дорога трудна, денег почти нет, покровителей — никаких. Ваш дядя, инок Феодор Санаксарский, говорит: жизнь надо отдать служению, а не выгоде.",
    "fon": "files/images/scene1.jpg",
    "variants": [
      { "text": "Ехать в Петербург и поступать в Морской корпус — рискнуть всем ради моря", "result": "1a", "correct": true },
      { "text": "Остаться в Бурнаково — спокойная жизнь помещика, зачем рисковать", "result": "1b" }
    ]
  },
  "2": {
    "title": "Чума в Херсоне",
    "text": "Год 1783. Вы прибыли в Херсон принять командование строящимся кораблём «Святой Павел». Но город охвачен чумой. Госпитали переполнены, люди мрут десятками. Ваша команда — триста душ, которых вы должны сохранить. Городское начальство бессильно. Врачи советуют просто ждать, пока мор пройдёт сам.",
    "fon": "files/images/scene2.jpg",
    "variants": [
      { "text": "Вывести команду в степь, разбить карантинный лагерь, ввести строжайшую изоляцию", "result": "2a", "correct": true },
      { "text": "Остаться в городе и положиться на госпитали и волю Божью", "result": "2b" },
      { "text": "Бросить строящийся корабль и увести людей подальше от Херсона", "result": "2c" }
    ]
  },
  "3": {
    "title": "«Святой Павел» у Херсонеса",
    "text": "Год 1785. После борьбы с чумой вы наконец привели свой 66-пушечный линейный корабль «Святой Павел» к крымским берегам. Перед вами — Ахтиарская бухта, место будущего Севастополя. Руины древнего Херсонеса Таврического белеют на мысу. Бухта идеальна для стоянки: глубокая, защищённая от ветров. Но другие офицеры считают, что крупным кораблям здесь тесно, и предлагают базироваться южнее, в открытых рейдах. Вам предстоит решить: ввести «Святого Павла» прямо в бухту у Херсонеса и доказать, что здесь может стоять линейный флот, или послушать осторожных и выбрать другое место.",
    "fon": "files/images/scene3.jpg",
    "variants": [
      { "text": "Ввести «Святого Павла» в Ахтиарскую бухту — доказать, что здесь место для главной базы флота", "result": "3a", "correct": true },
      { "text": "Послушать опытных офицеров и базироваться на открытом рейде южнее", "result": "3b" },
      { "text": "Направить корабль обратно в Херсон — бухта не обследована и может быть опасна", "result": "3c" }
    ]
  },
  "4": {
    "title": "Керченское сражение",
    "text": "8 июля 1790 года. У Керченского пролива, между Крымом и Таманью, ваши дозорные замечают огромный турецкий флот. Десятки боевых кораблей, а за ними — транспорты с десантом. Турки идут высадить войска в Крыму, вернуть полуостров. Ваша эскадра уступает противнику в числе пушек. Пролив узок, манёвр ограничен. Классическая тактика требует осторожного сближения в линии. Но вы видите: турецкие флагманы идут впереди, и если стремительно сблизиться и ударить именно по ним, весь строй противника рассыплется. Однако это риск — если атака захлебнётся, турецкий десант высадится беспрепятственно.",
    "fon": "files/images/scene4.jpg",
    "variants": [
      { "text": "Стремительно сблизиться и ударить по флагманам — сорвать десант любой ценой", "result": "4a", "correct": true },
      { "text": "Держать линию и вести бой на дальней дистанции по уставу", "result": "4b" },
      { "text": "Отступить к Керчи и встретить десант на берегу, сохранив корабли", "result": "4c" }
    ]
  },
  "5": {
    "title": "Штурм Корфу",
    "text": "Год 1799. Вы командуете русско-турецкой эскадрой у Ионических островов. Крепость Корфу считается неприступной: мощные бастионы, французский гарнизон, островные форты Видо и Лазаретто. Ваши союзники-турки ненадёжны, англичане Нельсона обещают помощь, но тянут время. Суворов из Италии шлёт письмо: «Зачем вам Нельсон? Вы сами — Нельсон!»",
    "fon": "files/images/scene5.jpg",
    "variants": [
      { "text": "Штурмовать немедленно — внезапность важнее численного перевеса", "result": "5a", "correct": true },
      { "text": "Ждать подкрепления от англичан — один в поле не воин", "result": "5b" },
      { "text": "Ограничиться блокадой — голод сделает своё дело", "result": "5c" }
    ]
  },
  "6": {
    "title": "Судьба пленных",
    "text": "Год 1799. Крепость Корфу пала. Французский гарнизон сдался. Ваши союзники-турки требуют расправы над пленными — таков их обычай. Часть ваших офицеров согласна: французы — враги веры и монархии, якобинцы. Но среди пленных много раненых, и вы видите испуг в их глазах. Вы вспоминаете слова дяди о милосердии.",
    "fon": "files/images/scene6.jpg",
    "variants": [
      { "text": "Взять пленных под свою защиту и обращаться с ними достойно", "result": "6a", "correct": true },
      { "text": "Передать пленных туркам — они союзники, нельзя их обижать", "result": "6b" },
      { "text": "Отпустить французов под честное слово не воевать", "result": "6c" }
    ]
  },
  "7": {
    "title": "Последний выбор",
    "text": "Год 1807. Вам шестьдесят два. Новый император Александр I отодвинул вас на второстепенный пост. Интриги, зависть, бюрократия. Ваши заслуги забыты при дворе. Адмиральский мундир пылится. Вам предлагают: либо остаться и бороться за влияние, плести интриги, добиваться назначений — либо уйти в отставку, в тихую Алексеевку у Санаксарского монастыря, раздать имущество бедным.",
    "fon": "files/images/scene7.jpg",
    "variants": [
      { "text": "Уйти в отставку и посвятить остаток жизни молитве и помощи бедным", "result": "7a", "correct": true },
      { "text": "Бороться за своё место — флот нуждается в опытных адмиралах", "result": "7b" },
      { "text": "Написать мемуары и рассказать правду о несправедливости", "result": "7c" }
    ]
  }
}