[
  {
    "conditions": [{ "type": "percent", "min": 100, "max": 100 }],
    "texts": [
      "Благодарение Богу: во всех делах вы действовали как истинный Ушаков. Ни одного отступления, ни одного малодушного решения. Вы — тот самый адмирал, в честь которого называют корабли. Фёдор Фёдорович с того света одобрительно кивает треуголкой.",
      "Идеальный результат! Каждый ваш выбор совпал с решением Ушакова. Вы прошли путь непобеждённого адмирала от первого до последнего шага. Такой результат — редкость: не каждый способен мыслить как святой воин.",
      "Совершенный путь. Вы не дрогнули ни разу — ни перед чумой, ни перед турецким флотом, ни перед придворными интригами. Ушаков бы принял вас в свою эскадру без экзаменов."
    ]
  },
  {
    "conditions": [{ "type": "percent", "min": 86, "max": 99 }],
    "texts": [
      "Вы почти безупречны! Одно-два решения отличались от ушаковских, но в целом вы — достойный командир Черноморского флота. Как говорил Ушаков: «подчинённые суть лучшая наша надежда» — и вы эту надежду не посрамили.",
      "Блестящий результат. Лишь в мелочах вы разошлись с великим адмиралом. Суворов бы написал о вас: «Почти Ушаков! Но почему не совсем?»",
      "Великолепно. Вы мыслите как флотоводец — смело, решительно, с заботой о людях. Одна-две развилки привели вас другим путём, но главный курс верен."
    ]
  },
  {
    "conditions": [{ "type": "percent", "min": 72, "max": 85 }],
    "texts": [
      "Крепкий капитан первого ранга. Вы приняли несколько решений иначе, чем Ушаков, но основную линию выдержали. «Невеликое число верных решений, хорошо исполненных, может навести страх на неприятеля» — это и о вас тоже.",
      "Хороший офицер с собственным характером. Ушаков бы отметил вашу решительность, хотя и покачал бы головой в паре моментов. Адмиральский мостик ещё впереди.",
      "Достойный путь. Не каждое решение совпало, но вы ни разу не предали главного — чести и долга. Потёмкин бы вас повысил."
    ]
  },
  {
    "conditions": [{ "type": "percent", "min": 57, "max": 71 }],
    "texts": [
      "Половина решений совпала с ушаковскими. Вы — крепкий морской офицер, но до адмирала ещё расти. Ушаков бы сказал: «Они во всём словам моим верят» — вот только вы не всегда прислушивались.",
      "Средний результат, но не безнадёжный. Вы колебались там, где Ушаков действовал без сомнений. Но сам факт, что вы выбрали море — уже немало.",
      "Вы нашли свой путь, пусть он и расходится с ушаковским. Не каждый рождён адмиралом, но каждый может учиться у великих."
    ]
  },
  {
    "conditions": [{ "type": "percent", "min": 43, "max": 56 }],
    "texts": [
      "Вы шли своим курсом, часто расходясь с Ушаковым. Может быть, в вас больше от Войновича, который предпочитал действовать по уставу. Ушаков заметил бы: «Против командующих все защищения трудны» — но вы и не очень-то старались.",
      "Больше расхождений, чем совпадений. Ваш путь — путь осторожного офицера, не рискующего без приказа. Для мирного времени — неплохо. Для войны — недостаточно.",
      "Вы выбрали безопасность чаще, чем славу. Ушаков бы понял, но не одобрил. Великие победы требуют великого риска."
    ]
  },
  {
    "conditions": [{ "type": "percent", "min": 29, "max": 42 }],
    "texts": [
      "Осторожность — ваше второе имя. Ушаков рисковал, вы — берегли. Может, и правильно: целый корабль лучше потопленного. Но великих побед осторожностью не одерживают.",
      "Вы скорее береговой чиновник, чем морской волк. Бумаги в порядке, команда сыта, но враг не разбит. Ушаков бы вздохнул.",
      "Мало совпадений. Вы действовали по логике, а не по интуиции воина. Иногда логика проигрывает дерзости — и это как раз тот случай."
    ]
  },
  {
    "conditions": [{ "type": "percent", "min": 15, "max": 28 }],
    "texts": [
      "Вы действовали почти во всём наоборот. Возможно, где-то в параллельной вселенной вы — великий адмирал с собственной тактикой. Но в нашей — Ушаков бы вас отправил обратно в Морской корпус на переэкзаменовку.",
      "Почти полное расхождение. Ваш путь — антипод ушаковского. Любопытно: вы намеренно или случайно? В любом случае, корабль вашим именем не назовут.",
      "Минимум совпадений. Вы выбирали то, от чего Ушаков отказывался. Может, в этом есть своя логика — но история её не подтвердила."
    ]
  },
  {
    "conditions": [{ "type": "percent", "min": 1, "max": 14 }],
    "texts": [
      "Кажется, вы целенаправленно делали всё наоборот. Это тоже талант! Ушаков бы сказал: «Много раз сношу напрасные обиды» — вот только ваши решения не обиды, а катастрофы.",
      "Одно-единственное совпадение — и то, возможно, случайное. Вы — зеркальное отражение Ушакова: где он шёл вперёд, вы отступали, где он рисковал, вы перестраховывались.",
      "Практически идеальный антирезультат. Пройдите ещё раз — но теперь попробуйте выбирать то, что кажется самым рискованным. Возможно, вы удивитесь."
    ]
  },
  {
    "conditions": [{ "type": "percent", "min": 0, "max": 0 }],
    "texts": [
      "Ни одного совпадения с Ушаковым! Поздравляем — это тоже своего рода достижение. В архивах Ярославской губернии пылилась бы ваша фамилия среди мелких помещиков. Корабли в вашу честь точно не назвали бы. Разве что лодку. Весельную.",
      "Абсолютный ноль. Вы прошли весь путь, не совпав с Ушаковым ни разу. Статистически это почти так же сложно, как совпасть во всём. Уникальный результат!",
      "Полное расхождение. Вы и Ушаков — как два корабля, идущие встречными курсами. Может, именно поэтому стоит пройти ещё раз?"
    ]
  },
  {
    "conditions": [{ "type": "counter", "name": "land", "op": ">=", "value": 1 }],
    "texts": [
      "Вы решили не ходить в море! Где-то грустно вздохнул целый Черноморский флот. «Море — это хорошо, но родная деревня лучше» — так мог бы сказать помещик Ушаков из Бурнаково. Только его никто бы не запомнил.",
      "Сухопутный выбор в первой же сцене задал тон всему прохождению. Без моря нет адмирала, без риска нет славы. Но, может быть, в тихой жизни есть своя мудрость — Ушаков бы не осудил, он бы понял.",
      "Вы остались на берегу, и все последующие решения — лишь тень того, что могло бы быть. Море ждало вас, но вы не пришли. История пошла другим путём."
    ]
  },
  {
    "conditions": [{ "type": "counter", "name": "cowardice", "op": ">=", "value": 2 }],
    "texts": [
      "Дважды вы выбрали отступление. Ушаков не отступал ни разу за всю карьеру. «В собственных деньгах будьте щедрым, в казённых — скупым», а в храбрости — расточительным. Вы же поскупились на храбрость.",
      "Отступление — иногда мудрость, но не дважды подряд. Ваша осторожность перешла в нерешительность. Флот под таким командованием не побеждает — он выживает. А этого мало.",
      "Два отступления — это уже не тактика, а характер. Ушаков бы сказал: «Лучше погибнуть со славой, чем жить с позором». Впрочем, вы живы — и это тоже результат."
    ]
  },
  {
    "conditions": [{ "type": "counter", "name": "mercy", "op": ">=", "value": 2 }],
    "texts": [
      "Милосердие — ваша главная черта. Ушаков тоже был милосерден, но с умом. Побеждённых надо не унижать, но и не распускать. Вы — добрый адмирал. Редкое сочетание слов, но оно существует.",
      "Вы проявили милосердие не один раз — это не случайность, а принцип. Ушаков бы одобрил: он сам защищал пленных и помогал бедным. Сила без милости — тирания. Вы это поняли.",
      "Двойное милосердие. Вы не только победили — вы победили благородно. Именно это отличало Ушакова от других адмиралов его эпохи."
    ]
  },
  {
    "conditions": [{ "type": "counter", "name": "faith", "op": ">=", "value": 3 }],
    "texts": [
      "Вера и служение — вот ваш компас. Как и Ушаков, вы уповаете не столько на людей, сколько на Промысел. «Во всех делах моих имею вернейшую на помощь Его надежду» — эти слова могли бы быть и вашими.",
      "Глубокая вера пронизывает ваши решения. Ушаков был не просто адмиралом — он был воином-монахом по духу. Вы идёте тем же путём: не ради славы, а ради правды.",
      "Три и более очков веры — вы прошли путь как человек, для которого совесть важнее карьеры. Именно поэтому Ушакова канонизировали — и именно поэтому ваш путь ему созвучен."
    ]
  },
  {
    "conditions": [{ "type": "counter", "name": "court", "op": ">=", "value": 2 }],
    "texts": [
      "Вы — придворный адмирал. Паркет дворца вам ближе палубы корабля. Ушаков бежал от двора при первой возможности. Вы же к нему прилипли. Что ж, у каждого свой фарватер. Только в честь придворных не называют броненосцы.",
      "Двор затянул вас. Балы, чины, интриги — всё это вместо солёного ветра и грохота канонады. Ушаков выбрал иное и не пожалел. Вы выбрали комфорт — и история вас не запомнила.",
      "Придворная карьера — красивая клетка. Вы вошли в неё добровольно, дважды. Ушаков бы покачал головой: «Настоящее дело — не парады, а служение»."
    ]
  },
  {
    "conditions": [{ "type": "counter", "name": "tactics", "op": ">=", "value": 2 }],
    "texts": [
      "Вы — прирождённый тактик! Нарушать правила ради победы, бить по флагману, ставить врага в два огня — Ушаков гордился бы таким учеником. «Они стреляют не часто, но так метко» — это и о вашем стиле.",
      "Тактическое мастерство — ваш конёк. Вы мыслите как Ушаков: не следовать шаблону, а создавать свой план в каждом бою. Линейную тактику вы ломаете с удовольствием — и с результатом.",
      "Два тактических попадания. Вы видите поле боя так, как его видел Ушаков — не линии на карте, а живую ситуацию, где дерзость побеждает численность."
    ]
  },
  {
    "conditions": [
      { "type": "counter", "name": "crew_care", "op": ">=", "value": 1 },
      { "type": "counter", "name": "mercy", "op": ">=", "value": 1 }
    ],
    "texts": [
      "Вы заботитесь о людях — и о своих, и о чужих. Ушаков писал: «Подчинённые суть лучшая наша надежда». Вы эту надежду оправдали.",
      "Забота о команде и милосердие к врагу — редкое сочетание. Ушаков был именно таким: жёстким в бою и добрым после победы. Вы разделяете его принципы.",
      "Люди для вас — не расходный материал. Ни свои, ни чужие. Это ушаковский подход: побеждать — но не терять человечность."
    ]
  },
  {
    "conditions": [
      { "type": "counter", "name": "courage", "op": ">=", "value": 2 },
      { "type": "counter", "name": "caution", "op": ">=", "value": 2 }
    ],
    "texts": [
      "Интересное сочетание: вы одновременно смелы и осторожны. Где-то рисковали, где-то берегли. Ушаков был последователен в дерзости, вы же — непредсказуемы. Может, в этом ваша сила?",
      "Отвага и осторожность борются в вас. Вы — офицер с внутренним конфликтом: сердце рвётся в бой, а разум шепчет «подожди». Ушаков решил этот конфликт в пользу сердца.",
      "Два очка смелости и два — осторожности. Вы сами себе противоречите. Но, может быть, именно это делает вас живым человеком, а не персонажем учебника."
    ]
  },
  {
    "conditions": [
      { "type": "counter", "name": "wisdom", "op": ">=", "value": 1 },
      { "type": "counter", "name": "honor", "op": ">=", "value": 1 },
      { "type": "counter", "name": "faith", "op": ">=", "value": 1 }
    ],
    "texts": [
      "Мудрость, честь и вера — три кита, на которых стоял Ушаков. И вы собрали все три. Такой результат говорит о глубоком понимании не только тактики, но и духа великого адмирала.",
      "Тройное сочетание: мудрость в решениях, честь в победе, вера в сердце. Ушаков был именно таким — и церковь канонизировала его не за победы, а за эти качества."
    ]
  }
]